In [1]:
import pandas as pd

# Q1

In [5]:
s=pd.Series([4,8,15,16,23,42])

In [6]:
s

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

# Q2

In [9]:
x=[1,2,3,4,5,6,7,8,9,10]
s1=pd.Series(x)
s1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

# Q3

In [8]:
d={'Name':['Alice','Bob','Claire'],
   'Age':[25,30,27],
   'Gender':['female','male','female']
}
df=pd.DataFrame(d)
df

     Name  Age  Gender
0   Alice   25  female
1     Bob   30    male
2  Claire   27  female

# Q4

# In pandas, a DataFrame is a two-dimensional data structure that represents tabular data. It is similar to a table in a relational database or a spreadsheet with rows and columns. Dataframes is designed to handle and manipulate structured data effectively.

In [10]:
# Example
d={'Name':['Alice','Bob','Claire'],
   'Age':[25,30,27],
   'Gender':['female','male','female']
}
df=pd.DataFrame(d)
df

     Name  Age  Gender
0   Alice   25  female
1     Bob   30    male
2  Claire   27  female

# A pandas Series is a one-dimensional labeled array that can hold any data type. It can be thought of as a single column from a DataFrame. A Series contains a sequence of values and a corresponding sequence of index labels that uniquely identify each element.

In [11]:
# Example
x=[1,2,3,4,5,6,7,8,9,10]
s1=pd.Series(x)
s1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

# Q5

# some common functions which we use in data manipulation in pandas are:-
df.head()  
df.tail()   
type(df['column_name'])  
df.describe()  
df.info()  
df.shape()  
df.sort_values()  
df.dtypes  
etc

# df.head() is used to find the top 5 data of the dataframe. By default it returns top 5 data but we can give any value in the argument.
# df.shape() returns the dimension of the dataframe

# Q6

# DataFrame objects in pandas are mutable, meaning they can be modified after creation.

# Series objects, on the other hand, are immutable in pandas. Once a Series is created, its values cannot be changed individually.

# Panel data structure in pandas was also mutable but nowadays, panel is depracated and is not continued in the newer version of python

# Q7

In [16]:
name_series=pd.Series(['Alice','Bob','Claire'],name='Name')
age_series=pd.Series([25,30,27],name='Age')
gender_series=pd.Series(['Female','Male','Female'],name='Gender')
df2=pd.concat([name_series,age_series,gender_series],axis=1)
df2

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

# Each series was a 1 dimensional data set and we use concat() function to concatenate the series to form a regular dataframe, here we have passed the axis as 1 so that the concatenation happens column wise, if we would have given the axis to be 0, then the concatenation would have been row wise.